In [1]:
import numpy as np
import pandas as pd

In [2]:
air=pd.read_csv('Airlines_cust.csv')
air

,id,Gender,Customer Type,Age,Type of Travel,Class,Flight Distance,satisfaction
0,70172,Male,Loyal Customer,13,Personal Travel,Eco Plus,460,neutral or dissatisfied
1,5047,Male,disloyal Customer,25,Business travel,Business,235,neutral or dissatisfied
2,110028,Female,Loyal Customer,26,Business travel,Business,1142,satisfied
3,24026,Female,Loyal Customer,25,Business travel,Business,562,neutral or dissatisfied
4,119299,Male,Loyal Customer,61,Business travel,Business,214,satisfied
...,...,...,...,...,...,...,...,...
103899,94171,Female,disloyal Customer,23,Business travel,Eco,192,neutral or dissatisfied
103900,73097,Male,Loyal Customer,49,Business travel,Business,2347,satisfied
103901,68825,Male,disloyal Customer,30,Business travel,Business,1995,neutral or dissatisfied
103902,54173,Female,disloyal Customer,22,Business travel,Eco,1000,neutral or dissatisfied
103903,62567,Male,Loyal Customer,27,Business travel,Business,1723,neutral or dissatisfied

In [3]:
air[air['id'].isna()]

Empty DataFrame
Columns: [id, Gender, Customer Type, Age, Type of Travel, Class, Flight Distance, satisfaction]
Index: []

In [4]:
airk=pd.isnull(air['Class'])
air[airk]

Empty DataFrame
Columns: [id, Gender, Customer Type, Age, Type of Travel, Class, Flight Distance, satisfaction]
Index: []

In [5]:
air.isna().any(axis=1)

0         False
1         False
2         False
3         False
4         False
          ...
103899    False
103900    False
103901    False
103902    False
103903    False
Length: 103904, dtype: bool

In [6]:
air['Class'].unique()

array(['Eco Plus', 'Business', 'Eco'], dtype=object)

In [7]:
air.dtypes

id                  int64
Gender             object
Customer Type      object
Age                 int64
Type of Travel     object
Class              object
Flight Distance     int64
satisfaction       object
dtype: object

In [8]:
air['Customer Type'].unique()

array(['Loyal Customer', 'disloyal Customer'], dtype=object)

In [9]:
air.replace('disloyal Customer','Disloyal Customer')

,id,Gender,Customer Type,Age,Type of Travel,Class,Flight Distance,satisfaction
0,70172,Male,Loyal Customer,13,Personal Travel,Eco Plus,460,neutral or dissatisfied
1,5047,Male,Disloyal Customer,25,Business travel,Business,235,neutral or dissatisfied
2,110028,Female,Loyal Customer,26,Business travel,Business,1142,satisfied
3,24026,Female,Loyal Customer,25,Business travel,Business,562,neutral or dissatisfied
4,119299,Male,Loyal Customer,61,Business travel,Business,214,satisfied
...,...,...,...,...,...,...,...,...
103899,94171,Female,Disloyal Customer,23,Business travel,Eco,192,neutral or dissatisfied
103900,73097,Male,Loyal Customer,49,Business travel,Business,2347,satisfied
103901,68825,Male,Disloyal Customer,30,Business travel,Business,1995,neutral or dissatisfied
103902,54173,Female,Disloyal Customer,22,Business travel,Eco,1000,neutral or dissatisfied
103903,62567,Male,Loyal Customer,27,Business travel,Business,1723,neutral or dissatisfied

In [10]:
air.replace('disloyal Customer','Disloyal Customer',inplace=True)

In [11]:
air

,id,Gender,Customer Type,Age,Type of Travel,Class,Flight Distance,satisfaction
0,70172,Male,Loyal Customer,13,Personal Travel,Eco Plus,460,neutral or dissatisfied
1,5047,Male,Disloyal Customer,25,Business travel,Business,235,neutral or dissatisfied
2,110028,Female,Loyal Customer,26,Business travel,Business,1142,satisfied
3,24026,Female,Loyal Customer,25,Business travel,Business,562,neutral or dissatisfied
4,119299,Male,Loyal Customer,61,Business travel,Business,214,satisfied
...,...,...,...,...,...,...,...,...
103899,94171,Female,Disloyal Customer,23,Business travel,Eco,192,neutral or dissatisfied
103900,73097,Male,Loyal Customer,49,Business travel,Business,2347,satisfied
103901,68825,Male,Disloyal Customer,30,Business travel,Business,1995,neutral or dissatisfied
103902,54173,Female,Disloyal Customer,22,Business travel,Eco,1000,neutral or dissatisfied
103903,62567,Male,Loyal Customer,27,Business travel,Business,1723,neutral or dissatisfied

In [12]:
air1=air.groupby(by='Class').count()
air1

,id,Gender,Customer Type,Age,Type of Travel,Flight Distance,satisfaction
Class,,,,,,,
Business,49665,49665,49665,49665,49665,49665,49665
Eco,46745,46745,46745,46745,46745,46745,46745
Eco Plus,7494,7494,7494,7494,7494,7494,7494

In [13]:
air.duplicated().sum()

0

In [14]:
air['Flight Distance'].max()

4983

In [15]:
air['Flight Distance'].min()

31

In [16]:
Q1=air['Flight Distance'].describe()['25%']
Q1

414.0

In [17]:
Q3=air['Flight Distance'].describe()['75%']
Q3

1743.0

In [18]:
IQR=Q3-Q1
IQR

1329.0

In [19]:
air.describe()

                  id            Age  Flight Distance
count  103904.000000  103904.000000    103904.000000
mean    64924.210502      39.379706      1189.448375
std     37463.812252      15.114964       997.147281
min         1.000000       7.000000        31.000000
25%     32533.750000      27.000000       414.000000
50%     64856.500000      40.000000       843.000000
75%     97368.250000      51.000000      1743.000000
max    129880.000000      85.000000      4983.000000

In [20]:
UF=Q3+(1.5*IQR)
LF=Q1-(1.5*IQR)
UF,LF

(3736.5, -1579.5)

In [21]:
air['Class'].value_counts()

Business    49665
Eco         46745
Eco Plus     7494
Name: Class, dtype: int64

In [22]:
range_umur=[]
for i in range (len(air)):
    if 0 < air['Age'].loc[i] <= 15:
        range_umur.append('Tidak berpenghasilan')
    elif 15 < air['Age'].loc[i] <= 30:
        range_umur.append('Berpenghasilan rendah')
    elif 30 < air['Age'].loc[i] <= 45:
        range_umur.append('Berpenghasilan sedang')
    elif 45 < air['Age'].loc[i] :
        range_umur.append('Berpenghasilan tinggi')
    else:
       range_umur.append('Umur aneh')

In [23]:
air['Range umur']=range_umur
air

,id,Gender,Customer Type,Age,Type of Travel,Class,Flight Distance,satisfaction,Range umur
0,70172,Male,Loyal Customer,13,Personal Travel,Eco Plus,460,neutral or dissatisfied,Tidak berpenghasilan
1,5047,Male,Disloyal Customer,25,Business travel,Business,235,neutral or dissatisfied,Berpenghasilan rendah
2,110028,Female,Loyal Customer,26,Business travel,Business,1142,satisfied,Berpenghasilan rendah
3,24026,Female,Loyal Customer,25,Business travel,Business,562,neutral or dissatisfied,Berpenghasilan rendah
4,119299,Male,Loyal Customer,61,Business travel,Business,214,satisfied,Berpenghasilan tinggi
...,...,...,...,...,...,...,...,...,...
103899,94171,Female,Disloyal Customer,23,Business travel,Eco,192,neutral or dissatisfied,Berpenghasilan rendah
103900,73097,Male,Loyal Customer,49,Business travel,Business,2347,satisfied,Berpenghasilan tinggi
103901,68825,Male,Disloyal Customer,30,Business travel,Business,1995,neutral or dissatisfied,Berpenghasilan rendah
103902,54173,Female,Disloyal Customer,22,Business travel,Eco,1000,neutral or dissatisfied,Berpenghasilan rendah
103903,62567,Male,Loyal Customer,27,Business travel,Business,1723,neutral or dissatisfied,Berpenghasilan rendah

In [24]:
air['Range umur'].value_counts()

Berpenghasilan tinggi    37895
Berpenghasilan sedang    33252
Berpenghasilan rendah    26709
Tidak berpenghasilan      6048
Name: Range umur, dtype: int64

In [25]:
range_jarak=[]
for i in range (len(air)):
    if 0 < air['Flight Distance'].loc[i] <= 1500:
        range_jarak.append('Jarak pendek')
    elif 1500 < air['Flight Distance'].loc[i] <= 3000:
        range_jarak.append('Jarak sedang')
    elif 3000 < air['Flight Distance'].loc[i]:
        range_jarak.append('Jarak jauh')
    else:
        range_jarak.append('Bukan jarak beneran')

In [26]:
air['Jauh jarak']=range_jarak
air

,id,Gender,Customer Type,Age,Type of Travel,Class,Flight Distance,satisfaction,Range umur,Jauh jarak
0,70172,Male,Loyal Customer,13,Personal Travel,Eco Plus,460,neutral or dissatisfied,Tidak berpenghasilan,Jarak pendek
1,5047,Male,Disloyal Customer,25,Business travel,Business,235,neutral or dissatisfied,Berpenghasilan rendah,Jarak pendek
2,110028,Female,Loyal Customer,26,Business travel,Business,1142,satisfied,Berpenghasilan rendah,Jarak pendek
3,24026,Female,Loyal Customer,25,Business travel,Business,562,neutral or dissatisfied,Berpenghasilan rendah,Jarak pendek
4,119299,Male,Loyal Customer,61,Business travel,Business,214,satisfied,Berpenghasilan tinggi,Jarak pendek
...,...,...,...,...,...,...,...,...,...,...
103899,94171,Female,Disloyal Customer,23,Business travel,Eco,192,neutral or dissatisfied,Berpenghasilan rendah,Jarak pendek
103900,73097,Male,Loyal Customer,49,Business travel,Business,2347,satisfied,Berpenghasilan tinggi,Jarak sedang
103901,68825,Male,Disloyal Customer,30,Business travel,Business,1995,neutral or dissatisfied,Berpenghasilan rendah,Jarak sedang
103902,54173,Female,Disloyal Customer,22,Business travel,Eco,1000,neutral or dissatisfied,Berpenghasilan rendah,Jarak pendek
103903,62567,Male,Loyal Customer,27,Business travel,Business,1723,neutral or dissatisfied,Berpenghasilan rendah,Jarak sedang

In [27]:
# 1. Tipe perjalanan apa yang paling diminati penumpang berdasarkan Customer Type dan Class
pd.crosstab(index = [air['Customer Type'], air['Class'], air['Type of Travel']],
            columns = ['Jumlah'], colnames = ['Kategori customer'])

Kategori customer                           Jumlah
Customer Type     Class    Type of Travel
Disloyal Customer Business Business travel    7345
                           Personal Travel      11
                  Eco      Business travel   10761
                           Personal Travel     149
                  Eco Plus Business travel     711
                           Personal Travel       4
Loyal Customer    Business Business travel   40163
                           Personal Travel    2146
                  Eco      Business travel    9496
                           Personal Travel   26339
                  Eco Plus Business travel    3179
                           Personal Travel    3600

In [28]:
# 2. Kelas penerbangan apa yang penjualannya terendah ?
air['Class'].value_counts()

Business    49665
Eco         46745
Eco Plus     7494
Name: Class, dtype: int64

**Kesimpulan**:
- Penjualan tiket pesawat terendah ada pada class Eco Plus
- Kami mengasumsikan bahwa perbandingan harga atau kualitas dari class Eco Plus dan Business tidak berbeda jauh, sehingga pembeli lebih memilih Class Business.

**Rekomendasi**:
- Naikan kualitas pelayanan penerbangan untuk Class Eco Plus
- Turunkan harga tiket penerbangan untuk Class Eco Plus, agar Quantity dari penjualan tiket Eco Plus bisa naik

**Asumsi**:
- Harga tiket Eco Plus semula 800000
- Penjualan awal tiket Eco Plus = 7.494 * 800.000 = 5.995.200.000

**Saran**:
Apabila perusahaan menurunkan harga tiket Eco Plus menjadi 700.000, asumsikan penjualan tiket akan naik menjadi 10.000.
Maka pendapatan dari penjualan tiket Eco Plus sebesar:
10.000 * 700.000 = 7.000.000.000
Selisih profit:
7.000.000.000 - 5.995.200.000 = 1.004.800.000

In [29]:
# 3. Kelas apa yang penjualannya paling banyak pada penerbangan jarak jauh
pd.crosstab(index = [air['Class'], air['Jauh jarak']],
            columns = ['Jumlah'], colnames = ['Kategori Jarak'])

Kategori Jarak         Jumlah
Class    Jauh jarak
Business Jarak jauh      8204
         Jarak pendek   23368
         Jarak sedang   18093
Eco      Jarak jauh        49
         Jarak pendek   42378
         Jarak sedang    4318
Eco Plus Jarak jauh        12
         Jarak pendek    6687
         Jarak sedang     795

**Kesimpulan**:
- Business Class menjadi pilihan utama untuk penerbangan jarak jauh
- Sedangkan Eco Plus menjadi pilihan terakhir untuk penerbangan jarak jauh

In [30]:
# - 4. Bagaimana tanggapan penumpang terhadap penerbangan pribadi(personal travel)
pd.crosstab(index = [air['Type of Travel'], air['satisfaction']],
            columns = ['Jumlah'], colnames = ['Kategori Customer'])

Kategori Customer                        Jumlah
Type of Travel  satisfaction
Business travel neutral or dissatisfied   29909
                satisfied                 41746
Personal Travel neutral or dissatisfied   28970
                satisfied                  3279

#### **Kesimpulan**
- Dari tabel diatas bisa dilihat bahwa Business Class memiliki tingkat kepuasan yang paling tinggi.
- Kami mengasumsikan bahwa tingkat kepuasan penumpang berdasarkan pelayanan Business Class yang sangat baik.

In [31]:
# 5. Berdasarkan range umur, tipe kelas penerbangan apa yang paling banyak diminati ?
pd.crosstab(index = air['Class'],
            columns = air['Range umur'],
            values = air['Flight Distance'],
            aggfunc = 'count')

Range umur,Berpenghasilan rendah,Berpenghasilan sedang,Berpenghasilan tinggi,Tidak berpenghasilan
Class,,,,
Business,10252,18626,19867,920
Eco,14488,12412,15378,4467
Eco Plus,1969,2214,2650,661

**Kesimpulan**:
- Dari tabel diatas bisa dilihat bahwa range umur >= 45tahun kita asumsikan berpenghasilan tinggi lebih memilih untuk membeli tiket Business Class

**Kesimpulan**:
- Loyal Customer lebih memilih membeli tiket penerbangan Business Class
- Sedangkan Disloyal Customer lebih memilih membeli tiket penerbangan Eco Class
- Dari seluruh pertanyaan dan hasil jawaban diatas, kita bisa menarik kesimpulan bahwa penjualan tiket Eco Plus yang paling rendah
- Penjualan tiket tertinggi ada pada Business Class
- Business Class menjadi pilihan utama untuk penerbangan jarak jauh
- Lebih banyak penumpang (personal travel) memberikan feedback netral atau tidak puas
- Pembelian tiket penerbangan sesuai dengan penghasilan penumpang

**Asumsi**:
- Loyal customer sudah percaya dengan maskapai penerbangan ini, sehingga mereka tidak ragu untuk membeli tiket penerbangan Business Class
- Sedangkan Disloyal customer belum percaya dengan maskapai penerbangan ini, sehingga mereka ragu untuk membeli tiket penerbangan selain Eco Class
- Harga tiket Eco Plus semula 800.000
- Penjualan awal tiket Eco Plus = 7.494 * 800.000 = 5.995.200.000
- Karena untuk penerbangan jarak jauh, penumpang akan memilih penerbangan yang nyaman
- Misal jumlah feedback yang netral dan tidak puas dianggap setara(50:50), maka jumlah yang tidak puas masih lebih banyak dibanding feedback yang puas
- Semakin tinggi penghasilan penumpang, maka kelas penerbangan yang dipilih juga akan semakin tinggi

**Saran**:
- Tingkatkan pelayanan di semua tipe kelas penerbangan, agar semua penumpang percaya dengan maskapai ini
- Apabila perusahaan menurunkan harga tiket Eco Plus menjadi 700.000, asumsikan penjualan tiket akan naik menjadi 10.000.
  Maka pendapatan dari penjualan tiket Eco Plus sebesar:
  10.000 * 700.000 = 7.000.000.000
  Selisih profit:
  7.000.000.000 - 5.995.200.000 = 1.004.800.000